In [1]:
import pandas as pd
from pandas import Series,DataFrame
import numpy as np
import matplotlib.pyplot as plt

## 处理丢失数据

In [2]:
#None object
# np.nan (NaN) float

### 1.None

none是python自带的 类型为python object None不能参与任何计算中

In [3]:

#记录时间 %time    
#%timeit 平均运行时间 

%time np.arange(0,10000,dtype=int).sum()#第三个参数 是dype 指明类型  int float object
#285微秒

CPU times: user 499 µs, sys: 421 µs, total: 920 µs
Wall time: 676 µs

49995000

In [4]:
%time np.arange(0,10000,dtype=float).sum()#1.52毫秒  object用的时间更长 float其次

CPU times: user 351 µs, sys: 153 µs, total: 504 µs
Wall time: 407 µs

49995000.0

### 2. np.nan 能参与计算 但是结果为NaN

In [5]:
#数据的清洗 根据前后数据补充

#最简单的方法就是删除
df = DataFrame(
    {'age':[20,21,23,19,22],'salary':[12000,13000,18000,10000,15000]},
    index=['张三','李四','王五','赵六','杨七'],
    columns = ['age','salary','work']
)

display(df)

df.work['李四':'赵六'] = 'Python'

display(df)

    age  salary work
张三   20   12000  NaN
李四   21   13000  NaN
王五   23   18000  NaN
赵六   19   10000  NaN
杨七   22   15000  NaN

/anaconda3/lib/python3.6/site-packages/ipykernel/__main__.py:12: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

    age  salary    work
张三   20   12000     NaN
李四   21   13000  Python
王五   23   18000  Python
赵六   19   10000  Python
杨七   22   15000     NaN

In [6]:
'''
    isnull 为空返回true   返回布尔值
    notnull  不为空返回true
    dropna 过滤丢失数据
    fillna 
'''

#只要一行中 有一个TRUE 则结果是True 调用any检查每一列
s1 = df.isnull().any(axis = 1) 
#传进去 得到哪些个数据为空 

#有了s1这个数据 获取那些数据 为空
display(df[s1])

    age  salary work
张三   20   12000  NaN
杨七   22   15000  NaN

In [7]:
#notnull判断数据不为空 要让所有数据不为空 所有的数据都不为空 
s2 = df.notnull().all(axis = 1) #这一行所有的数据必须都为true  有一个False就是False
s2

张三    False
李四     True
王五     True
赵六     True
杨七    False
dtype: bool

In [10]:
#过滤函数 选择是行还是列

#删除有NaN的数据 删除一行
df.dropna(axis = 0)

    age  salary    work
李四   21   13000  Python
王五   23   18000  Python
赵六   19   10000  Python

In [11]:
#拉格朗日 通过算法 有个阶梯

#对所有的空数据进行了替换
df.fillna(value='java')

    age  salary    work
张三   20   12000    java
李四   21   13000  Python
王五   23   18000  Python
赵六   19   10000  Python
杨七   22   15000    java

In [16]:
#可以选则前向填充或者后向填充 
'''
    pad和ffill是前向填充
    backfill和bfill是后向填充
'''

display(df.fillna(method='backfill'))#杨七为NaN 因为后面没数据了

# display(df.fillna(method='ffill'))#f是forward  张三的数据又没了

#inplace= True 原来的数据就会发生变化
df.fillna(df.fillna(method='ffill'),inplace=True)#df进行修改 没有返回值

    age  salary    work
张三   20   12000  Python
李四   21   13000  Python
王五   23   18000  Python
赵六   19   10000  Python
杨七   22   15000     NaN